mf-gui.el
;-------   Theme   -------\

(setq custom-theme-directory "~/.emacs.d/themes")

(use-package sublime-themes
   :config
   (load-theme 'brin t))

(use-package moe-theme)

(use-package doom-themes)

;-------   General   -------\
