emacs.org
** GUI

   #+begin_src emacs-lisp :tangle ./mf-gui.el
					     ;-------   General   -------\

     ;;(setq inhibit-startup-message t)
     (scroll-bar-mode -1)
     (menu-bar-mode -1)
     (tool-bar-mode -1)
     (global-set-key (kbd "<f5>") 'menu-bar-mode)
     (set-fringe-mode 10)                    ; padding
     (tooltip-mode -1)
     ;;(setq visible-bell t)

     (column-number-mode)
     (global-display-line-numbers-mode t)

     (dolist (mode '(org-mode-hook
		     term-mode-hook
		     shell-mode-hook
		     eshell-mode-hook
		     pdf-view-mode-hook))
       (add-hook mode (lambda () (display-line-numbers-mode 0))))

   #+end_src


** Gui Packages

   | Package            | Description                              |
   |--------------------+------------------------------------------|
   | Diminish           | Hide selected modes from modeline        |
   | Rainbow-Delimiters | Color parethesies                        |
   | mlscroll           | Document location indicator for modeline |
   
   #+begin_src emacs-lisp :tangle ./mf-gui.el
					     ;-------   GUI Packages   -------\

     (use-package diminish)

     (eval-after-load "eldoc"
	'(diminish 'eldoc-mode))

     (diminish 'abbrev-mode)

     (use-package rainbow-delimiters
       :diminish
       :hook (prog-mode . rainbow-delimiters-mode))

     (use-package mlscroll
       :config
     ;;  breaks evil status indicator
     ;;  (setq mlscroll-shortfun-min-width 11) ;truncate which-func, for default mode-line-format's
       (mlscroll-mode 1))

     (use-package dired
       :ensure nil
       :commands (dired dired-jump)
       :bind (("C-x C-j" . dired-jump))
       :custom ((dired-listing-switches "-agho --group-directories-first")))

     (autoload 'dired-omit-mode "dired-x")	

     (use-package dired-single
       :commands (dired dired-jump))

     (use-package dired-ranger
       :defer t)

     (use-package dired-collapse
       :defer t)

   #+end_src 

 
** Fonts

   #+begin_src emacs-lisp :tangle ./mf-gui.el

					;-------   Fonts    -------\

;(set-face-attribute 'default nil :font "FONT NAME" :height ##)

   #+end_src


* mf-keys.el

** Key Packages

   | Package          | Description                      |
   |------------------+----------------------------------|
   | Evil             | Extensible VIm Layers            |
   | Evili Collection | Additional mode support for Evil |
   | General          | Leader keys                      |
   | Hydra            | Prefix bindings                  |

   #+begin_src emacs-lisp :tangle ./mf-keys.el
					     ;-------   Key Packages   -------\

     (use-package evil
       :init
       (setq evil-want-integration t)
       (setq evil-want-keybinding nil)
       (setq evil-want-C-u-scroll t)
       (setq evil-want-C-i-jump nil)
       (setq evil-mode-line-format 'after)
       (setq evil-disable-insert-state-bindings t)
       ;;(setq evil-undo-system undo-tree)
       :config
       (evil-mode 1)
       (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
       (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

       ;; Use visual line motions even outside of visual-line-mode buffers
       (evil-global-set-key 'motion "j" 'evil-next-visual-line)
       (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

       (evil-set-initial-state 'messages-buffer-mode 'normal)
       (evil-set-initial-state 'dashboard-mode 'normal))


     (use-package evil-collection
       :after evil
       :diminish evil-collection-unimpaired-mode
       :config
       (evil-collection-init))

     (use-package general
       :after evil
       :config
       (general-create-definer mf/leader-keys
	 :keymaps '(normal insert visual emacs)
	 :prefix "SPC"
	 :global-prefix "C-SPC"))

     (use-package hydra
       :defer t)

   #+end_src


** Definitions

   #+begin_src emacs-lisp :tangle ./mf-keys.el
					     ;-------   Key Definitions   -------\


  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "H" 'dired-omit-mode
    "l" 'dired-single-buffer
    "y" 'dired-ranger-copy
    "X" 'dired-ranger-move
    "p" 'dired-ranger-paste)

   #+end_src

   
** Functions

   | Function         | Description                      |
   |------------------+----------------------------------|
   | mf/leader-keys   | Define leader keys t, s, and fde |
   | hydra-text-scale | Scale text with j and k          |
   
   #+begin_src emacs-lisp :tangle ./mf-keys.el
					     ;-------   Key Functions   -------\

     (mf/leader-keys
       "t"  '(:ignore t :which-key "toggles")
       "fde" '(lambda () (interactive) (find-file (expand-file-name "~/.emacs.d/emacs.org")))
       "ts" '(hydra-text-scale/body :which-key "scale text"))

     (defhydra hydra-text-scale (:timeout 4)
       "scale text"
       ("j" text-scale-increase "in")
       ("k" text-scale-decrease "out")
       ("f" nil "finished" :exit t))

   #+end_src


* mf-org.el

** Org Functions

   | Function                | Description                                                 |
   |-------------------------+-------------------------------------------------------------|
   | mf/org-mode-set         | Diminish indent mode, visual line mode and evil auto indent |
   | mf/org-mode-visual-fill | Org mode column padding settings                            |

   #+begin_src emacs-lisp :tangle ./mf-org.el
					     ;-------   Org Function   -------\

     (defun mf/org-mode-setup ()
       (diminish 'org-indent-mode)
       ;;  (variable-pitch-mode 1)
       (visual-line-mode 1)
       (setq evil-auto-indent nil))

     (defun mf/org-mode-visual-fill ()
       (setq visual-fill-column-width 100
	     visual-fill-column-center-text t)
       (visual-fill-column-mode 1))

   #+end_src


** Org Packages

   #+begin_src emacs-lisp :tangle ./mf-org.el

					     ;-------   Packages   -------\

     (use-package org
       :pin org
       :commands (org-capture org-agenda)
       :hook (org-mode . mf/org-mode-setup)
       :config (setq org-startup-folded t
		     ;;org-ellipsis " ▾"
		     org-log-agenda-sater-with-log-mode t
		     org-log-done 'time
		     org-log-into-drawer t))

     (setq org-todo-keywords
	   '((type "TODO(t)" "HOLD(h)" "NEXT(n)" "|" "DONE(d!)")))

     (setq org-refile-targets
	   '(("Archive.org" :maxlevel . 1)
	     ("Tasks.org" :maxlevel . 1)))

     ;; Save Org buffers after refiling!
     (advice-add 'org-refile :after 'org-save-all-org-buffers)

     (use-package org-bullets
       :hook (org-mode . org-bullets-mode))

     (use-package visual-fill-column
	:hook (org-mode . mf/org-mode-visual-fill))

   #+end_src


** Org Agenda

   #+begin_src emacs-lisp :tangle ./mf-org.el

					     ;-------   Agenda   -------\

     (setq org-agenda-files
	   '("~/Documents/Org/todo.org"
	     "~/Documents/Org/to_get.org"))


     (setq org-agenda-custom-commands
	   '(("o" "Overview"
	      ((agenda "" ((org-deadline-warning-days 7)))
	       (todo "NEXT"
		     ((org-agenda-overriding-header "Next Tasks")))
	       (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

	     ("n" "Next Tasks"
	      ((todo "NEXT"
		     ((org-agenda-overriding-header "Next Tasks")))))


	     ("d" "Computer" tags-todo "+computer")

	     ("r" "Write" tags-todo "+write")

	     ("w" "Electrical Engineering" tags-todo "+ee")

	     ("p" "Music Production" tags-todo "+music")

	     ("W" "Workflow"
	      ((todo "PLAN"
		     ((org-agenda-overriding-header "Plan")
		      (org-agenda-FILES ORG-AGENDA-files)))
	       (todo "DESIGN"
		     ((org-agenda-overriding-header "Design")
		      (org-agenda-files org-agenda-files)))
	       (todo "MAKE"
		     ((org-agenda-overriding-header "Make")
		      (org-agenda-files org-agenda-files)))))))

     (setq org-tag-alist
	   '((:startgroup)
	     ;; Put mutually exclusive tags here
	     (:endgroup)
	     ("computer" . ?d)
	     ("write" . ?r)
	     ("make" . ?f)
	     ("ee" . ?w)
	     ("music" . ?p)
	     ("idea" . ?i)))

   #+end_src


** Org Keys

   #+begin_src emacs-lisp :tangle ./mf-org.el

					     ;-------   Org Keys   -------\

     ;;(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))        
     ;;(define-key global-map "\C-cl" 'org-store-link)
     (define-key global-map "\C-ca" 'org-agenda)
     (define-key global-map "\C-cc" 'org-capture)
     ;;(define-key global-map (kbd "C-c c")
     ;;    (lambda () (interactive) (org-capture nil "jj")))
   #+end_src


* mf-templates.el

  #+begin_src emacs-lisp :tangle ./mf-templates.el
						;-------   Tempo Templates   -------\

    (with-eval-after-load 'org
      ;; This is needed as of Org 9.2
      (require 'org-tempo)

      (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
      (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
      (add-to-list 'org-structure-template-alist '("eli" . "src emacs-lisp :tangle ./init.el"))
      (add-to-list 'org-structure-template-alist '("elg" . "src emacs-lisp :tangle ./mf-gui.el"))
      (add-to-list 'org-structure-template-alist '("elk" . "src emacs-lisp :tangle ./mf-keys.el"))
      (add-to-list 'org-structure-template-alist '("elo" . "src emacs-lisp :tangle ./mf-org.el"))
      (add-to-list 'org-structure-template-alist '("elt" . "src emacs-lisp :tangle ./mf-templates.el"))
      (add-to-list 'org-structure-template-alist '("els" . "src emacs-lisp :tangle ./mf-sh.el"))
      (add-to-list 'org-structure-template-alist '("py" . "src python"))
      (tempo-define-template "org-recipe"
			     '( "** "p n n
				"*** Meta:" n n
				"   Dificulty    : " n
				"   Time         : " n
				"   Time Cooking : " n
				"   Servings     : " n
				"   Equipment    : "n n
				"*** Ingredients:"n n
				"    | Ingredient | Amount |" n
				"    |------------+--------|" n
				"    |            |        |" n
				"    |            |        |" n
				"    |            |        |"n n
				"*** Instrucions:"n n
				"    1. "n n
				"*** Notes:"n n
				"    - " n
				)
			     "<r" "Insert org-recipe" 'org-tempo-tags))


					    ;-------   Org Capture Templates   -------\


    (setq org-capture-templates
	  `(("t" "Tasks / Projects")
	    ("tt" "Task" entry (file+olp "/Org/todo.org" "Captured")
	     "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

	    ("j" "Journal Entries")
	    ("jj" "Journal" entry
	     (file+olp+datetree "~/Org/journal.org")
	     "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
	     ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
	     :clock-in :clock-resume
	     :empty-lines 1)))
	    ;; ("jm" "Meeting" entry
	    ;;  (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
	    ;;  "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
	    ;;  :clock-in :clock-resume
	    ;;  :empty-lines 1)))

	    ;; ("w" "Workflows")
	    ;; ("we" "Checking Email" entry (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
	    ;;  "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

	    ;; ("m" "Metrics Capture")
	    ;; ("mw" "Weight" table-line (file+headline "~/Projects/Code/emacs-from-scratch/OrgFiles/Metrics.org" "Weight")
	    ;;  "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))

 #+end_src


